//=============================================================================
//
// ボス処理 [Boss.h]
// Author : HAL東京 GP11B341-17 80277 染谷武志
//
//=============================================================================
#ifndef _BOSS_H_
#define _BOSS_H_

#include "main.h"


//*****************************************************************************
// マクロ定義
//*****************************************************************************
#define	BOSS_XFILE		"data/MODEL/sora_ai.x"		// 読み込むモデル名
#define BOSS_NUM		(1)						// エネミーの数
#define BOSS_HP_MAX		(200)
#define BOSS_DIRECTION	(200.0f)
#define BOSS_DIRECTION2	(360.0f)				// エネミーを反対向きに
#define BOSS_SCALE		(10.0f)
#define BOSS_XSCALE		(10.0f)

//*****************************************************************************
// グローバル変数
//*****************************************************************************

//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
HRESULT InitBoss(int type);
void UninitBoss(void);
void UpdateBoss(void);
void DrawBoss(void);
ENEMY *GetBoss(int en);
void SetVertexBoss(void);

#endif
