/*******************************************************************************
* タイトル:		ゲームヘッダー
* プログラム名:	Game.h
* 作成者:		GP11B341 01 飯塚春輝
* 作成日:		2018/07/26
*******************************************************************************/
#ifndef _GAME_H_
#define _GAME_H_

#include "Main.h"
#include "Struct.h"

enum GAME_TYPE
{
	GAME_TYPE_STAGE_ONNA,
	GAME_TYPE_STAGE_BLACK_HOLE,
	GAME_TYPE_STAGE_NEXT,
	GAME_TYPE_MAX,
};
//*****************************************************************************
// マクロ定義
//*****************************************************************************

//*****************************************************************************
// 構造体宣言
//*****************************************************************************

//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
HRESULT InitGame(void);
void UninitGame(void);
void UpdateGame(void);
void DrawGame(void);

void AddDamageEnemy(ENEMY *enemy, int damage);		// エネミーにダメージを与える
void AddDamagePlayer(CHARA *player, int damage);	// プレイヤーにダメージを与える

void Set_Game_Index(int Set_Index);
int Get_Game_Index(void);
#endif
