//=============================================================================
//
// 女.x処理 [Onna.h]
// Author : HAL東京 GP11B341-17 80277 染谷武志
//
//=============================================================================
#ifndef _ONNA_H_
#define _ONNA_H_

#include "main.h"


//*****************************************************************************
// マクロ定義
//*****************************************************************************
#define	ONNA_XFILE		"data/MODEL/onna.x"		// 読み込むモデル名
#define ONNA_NUM		(10)						// エネミーの数
#define ONNA_HP_MAX		(50)
#define ONNA_DIRECTION	(200.0f)
#define ONNA_DIRECTION2	(360.0f)				// エネミーを反対向きに
#define ONNA_SCALE		(3.0f)
#define ONNA_XSCALE		(10.0f)

//*****************************************************************************
// グローバル変数
//*****************************************************************************

//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
HRESULT InitOnna(int type);
void UninitOnna(void);
void UpdateOnna(void);
void DrawOnna(void);
ENEMY *GetOnna(int en);
void SetVertexOnna(void);

#endif
