//====================================================================================================================================================================================
// 概要
// ファイル名：Title.h
// コーディングフォント：Ricty Diminished( 16サイズ )
// 作成者：HAL東京 GP-11B-341 07 亀岡竣介
// 作成日：2018/12/10
//====================================================================================================================================================================================
#ifndef _TITLE_H_
#define _TITLE_H_
//====================================================================================================================================================================================
// マクロ定義
//====================================================================================================================================================================================
#define TEXTURE_FILE_TITLE_BACK_GROUND ("DATA/TEXTURE/Title_BackGround.png")	//	テクスチャファイル
#define TEXTURE_FILE_TITLE_LOGO ("DATA/TEXTURE/Title_Logo.png")					//	テクスチャファイル
#define TITLE_TEXTURE_SIZE_X_000 (SCREEN_WIDTH)									//	テクスチャサイズ (X)
#define TITLE_TEXTURE_SIZE_Y_000 (SCREEN_HEIGHT)								//	テクスチャサイズ (Y)
#define TITLE_TEXTURE_PATTERN_DIVIDE_X (1)										//	アニメーションパターンのテクスチャ内分割数( X )
#define TITLE_TEXTURE_PATTERN_DIVIDE_Y (1)										//	アニメーションパターンのテクスチャ内分割数( Y )
#define TITLE_MAX (TITLE_TYPE_MAX)												//	タイトルの最大数
//====================================================================================================================================================================================
// 列挙型定義
//====================================================================================================================================================================================
enum TITLE_TYPE
{
	TITLE_TYPE_BACK_GROUND,
	TITLE_TYPE_LOGO,
	TITLE_TYPE_MAX,
};
//====================================================================================================================================================================================
// 構造体定義
//====================================================================================================================================================================================
typedef struct
{
	LPDIRECT3DTEXTURE9 Texture = NULL;			//	テクスチャ
	VERTEX_2D Vertex[NUM_VERTEX];				//	頂点情報
	D3DXVECTOR3 Position = { NULL,NULL,NULL };	//	位置
	D3DXVECTOR3 Rotation = { NULL,NULL,NULL };	//	回転
	float Radius = NULL;						//	半径
	float Angle = NULL;							//	角度
}TITLE;
//====================================================================================================================================================================================
// プロトタイプ宣言
//====================================================================================================================================================================================
// Initialize
HRESULT Initialize_Title(void);

// Release
void Release_Title(void);

// Update
void Update_Title(void);

// Draw
void Draw_Title(void);

// Create
HRESULT Create_Vertex_Title(int Title_Index);

// Set
void Set_Vertex_Title(int Title_Index);
void Set_Texture_Title(int Title_Index);

// Get
TITLE *Get_Title(int Title_Index);
#endif